src/Documents/ИТСервисы_ИзминениеПараметровИТСервиса/ИТСервисы_ИзминениеПараметровИТСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ИзминениеПараметровИТСервиса</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Развитие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сопровождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_ПараметрыИТСервисов/ИТСервисы_ПараметрыИТСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ПараметрыИТСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаРазвитии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСопровождении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДорожнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриказОВводеВПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПаспортСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Архитектура</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БазаЗнаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорТП</name>
    <type>
      <types>Boolean</types>
      <types>DocumentRef.ИТСервисы_ДоговорСТехническимПровайдером</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_ИзминениеПараметровИТСервиса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ИТСервисы_ПараметрыИТСервисов.Записывать = Истина;
    Движения.ИТСервисы_ПараметрыИТСервисов.Очистить();

    Если Не ЗначениеЗаполнено(ИТСервис) Тогда
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Получаем текущее состояние из регистра
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаРазвитии КАК НаРазвитии,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаСопровождении КАК НаСопровождении,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.ПланПроектаВИСУП КАК ПланПроектаВИСУП,
    |	ИТСервисы_ПараметрыИТСервисовСрезПоследних.КодВАРМРазработчика КАК КодВАРМРазработчика
    |ИЗ
    |	РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&ДатаДокумента, ИТСервис В (&ИТСервис)) КАК ИТСервисы_ПараметрыИТСервисовСрезПоследних";

    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    Запрос.УстановитьПараметр("ИТСервис", ИТСервис);

    Выборка = Запрос.Выполнить().Выбрать();
  
    ТекущееСостояние = Новый Структура("Развитие,Сопровождение,ПланПроектаВИСУП,КодВАРМРазработчика");

    Если Выборка.Следующий() Тогда
        ЗаполнитьЗначенияСвойств(ТекущееСостояние, Выборка);
    КонецЕсли;

    // Создаём новую запись в регистр
    Запись = Движения.ИТСервисы_ПараметрыИТСервисов.Добавить();
    Запись.Период = Дата;
    Запись.ИТСервис = ИТСервис;

    // Копируем старое состояние
    ЗаполнитьЗначенияСвойств(Запись, ТекущееСостояние);

    // Применяем новые значения только если они указаны в документе
    Если ЗначениеЗаполнено(Развитие) Или Развитие = Ложь Тогда
        Запись.НаРазвитии = Развитие;
    КонецЕсли;

    Если ЗначениеЗаполнено(Сопровождение) Или Сопровождение = Ложь Тогда
        Запись.НаСопровождении = Сопровождение;
    КонецЕсли;

    Если ЗначениеЗаполнено(ПланПроектаВИСУП) Или ПланПроектаВИСУП = Ложь Тогда
        Запись.ПланПроектаВИСУП = ПланПроектаВИСУП;
    КонецЕсли;

    Если ЗначениеЗаполнено(КодВАРМРазработчика) Тогда
        Запись.КодВАРМРазработчика = КодВАРМРазработчика;
    КонецЕсли;

КонецПроцедуры
